# WriteAccessGranted Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..WriteAccessGranted Method
Schema Class See Also
---
Checks whether Entities of this Schema may be stored by the current add-in.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool WriteAccessGranted()
```

Visual Basic
---
```text
Public Function WriteAccessGranted As Boolean
```

Visual C++
---
```text
public:
bool WriteAccessGranted()
```

# ### Return Value
True if write access is allowed.
# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace